### Import Packages

In [1]:
import pandas as pd

### Import Data

In [2]:
df1 = pd.read_csv("dataset1.csv")
df2 = pd.read_csv("dataset2.csv")

In [3]:
df1.head()

             name       price
0   William Dixon  109.037280
1    Kristen Horn  262.524652
2  Kimberly Chang  187.007258
3       Mary Ball  283.174648
4  Benjamin Craig  143.871582

In [4]:
df2.head()

                 name        price
0      William Garcia  258.1809089
1     Barbara Freeman   141.890534
2   Rebecca Zimmerman   293.373272
3  Patricia Velasquez  249.9479246
4        Ronnie Clark   272.908659

### Functions

In [93]:
def process(df) :
    
    first_name = []
    last_name = []
    new_price = []
    above_100 = []
    
    # delete rows with no name
    df_clean = df[df['name'].notna()]
    df_clean = df_clean.reset_index(drop=True)
    df = df_clean
        
    # split name into first_name and last_name
    for i in range(0, len(df)) :
        name = df['name'][i]
        first_name.append(name.split(" ")[0])
        last_name.append(name.split(" ")[1])
        
    # remove prepended zeros in price
        price = df['price'][i]
        new_price.append(float(str(price).lstrip()))
        price = float(df['price'][i])
    
    # create new field above_100
        if price > 100 :
            above_100.append(True)
        else :
            above_100.append(False)
    
    # create result_df
    result_df = pd.DataFrame({"first_name": first_name, "last_name": last_name, "price": new_price, "above_100": above_100})
    
    return result_df

### Process df1 and df2

In [94]:
df1_processed = process(df1)
df1_processed.head()

  first_name last_name       price  above_100
0    William     Dixon  109.037280       True
1    Kristen      Horn  262.524652       True
2   Kimberly     Chang  187.007258       True
3       Mary      Ball  283.174648       True
4   Benjamin     Craig  143.871582       True

In [95]:
df2_processed = process(df2)
df2_processed.head()

  first_name  last_name       price  above_100
0    William     Garcia  258.180909       True
1    Barbara    Freeman  141.890534       True
2    Rebecca  Zimmerman  293.373272       True
3   Patricia  Velasquez  249.947925       True
4     Ronnie      Clark  272.908659       True

In [97]:
df1_processed.to_csv("dataset1_processed.csv", index=False)
df2_processed.to_csv("dataset2_processed.csv", index=False)

### Cron

@daily is 0 1 * * * --> minute | hour | day (month) | month | day (week)

In the vi editor, switch to insert mode (press i to edit the file) and add this command to execute the python script with the process function

0 1 * * * /usr/bin/python /path/to/file/<FILENAME>.oy /path/to/file/<FILENAME>.log
So in this case, the command is --> 0 1 * * * python process.py dataframe_path_1 dataframe_path_2
    
After writing the crontab, press esc to exit edit mode
    
Write :wq to write crontab